tap "mergestat/mergestat"
tap "n1kben/tap"
brew "ast-grep"
brew "bat"
brew "btop"
brew "coreutils"
brew "exiftool"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "go"
brew "jq"
brew "lazygit"
brew "tree-sitter"
brew "neovim"
brew "nmap"
brew "postgresql@14", restart_service: :changed
brew "python@3.13"
brew "ripgrep"
brew "stow"
brew "tmux"
brew "tree"
brew "tree-sitter-cli"
brew "volta"
brew "watchman"
brew "zig"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "n1kben/tap/fzf-tab"
cask "1password-cli"
cask "claude-code"
cask "font-sauce-code-pro-nerd-font"
cask "gitbutler"
