tap "n1kben/tap"
brew "bat"
brew "btop"
brew "coreutils"
brew "exiftool"
brew "fd"
brew "fzf"
brew "git"
brew "git-delta"
brew "jq"
brew "tree-sitter"
brew "neovim"
brew "postgresql@14"
brew "python@3.13"
brew "ripgrep"
brew "stow"
brew "tree-sitter-cli"
brew "volta"
brew "watchman"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "n1kben/tap/fzf-tab"
cask "1password-cli"
cask "font-sauce-code-pro-nerd-font"
